# 1. 华氏温度转换成摄氏温度 
# - 用python编写程序，输入华氏温度，计算输出摄氏温度，结果保留2位小数。
#   - c为摄氏温度，f为华氏温度
#   - 摄氏度(℃)=（华氏度(℉)-32）÷1.8
from re import I


def centigrade(f):
    c=(f-32)/1.8
    print("对应的摄氏度温度为：",round(c,1))

f=int(input("请输入华氏度温度："))
centigrade(f)


print("---------------------------------------------------")
# 2. 输入年份判断是否是闰年
# - 闰年规则如下，请编写程序判断输入是否闰年
#   - 公元年分非4的倍数，为平年。
#   - 公元年分为4的倍数但非100的倍数，为闰年。
#   - 公元年分为100的倍数但非400的倍数，为平年。
#   - 公元年分为400的倍数为闰年。
def leapyear(y):
    if y%4==0:
        print(y,"是闰年")
    else:
        print(y,"不是闰年")

y=int(input("请输入年份："))
leapyear(y)


print("---------------------------------------------------")
# 3. 1~100求和 
# - 请计算1-100的和

def count1_100():
    s=0
    i=1
    while i<=100:
        s+=i
        i+=1
    print(s)

count1_100()


print("---------------------------------------------------")
# 4. 打印九九表
# - 请使用python编程打印出九九乘法表

def multiple9_9():
    i=1
    while i<=9:
        j=1
        while j<=i:
            print(j,"*",i,"=",j*i,end="")
            print("  ",end="")
            j+=1
        print()
        i+=1

multiple9_9()


print("---------------------------------------------------")
# 5. 判断素数
# - 一个大于1的自然数，除了1和它自身外，不能被其他自然数整除的数叫做素数。请编写程序判断输入的数是否为素数。

def prime_number(i):
    j =2
    if i==2 or i==3:
        print(i,"是素数")
    else:
        while j<=i//2:
            if i%j==0:
                print(i,"不是素数")
                break
            else:
                j+=1
        if j>i//2:
            print(i,"是素数")
        # print(j)

i=int(input("请输入一个数："))
prime_number(i)
